A4/RT2_3d/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    topwall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          6400;
        startFace       3801600;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          6400;
        startFace       3808000;
    }
    leftWall
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          16000;
        startFace       3814400;
    }
    rightWall
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          16000;
        startFace       3830400;
    }
    frontWall
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          16000;
        startFace       3846400;
    }
    backWall
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          16000;
        startFace       3862400;
    }
)

// ************************************************************************* //
